#+OPTIONS: ^:{}

** Chasing a failing build under emacs snapshot                    :flycheck:
Trying to reproduce the Travis errors on my machine.

~./autogen.sh~ suggest I run ~./autogen.sh git~ after it.  This is not done in
the makefile.

Trying to run the tests with emacs 25, cannot find ~dash~.  ~make clean~ and
~make init~ fixes it, and now I have an error because warnings (same thing as
the Travis build):

#+BEGIN_EXAMPLE
In toplevel form:
flycheck.el:5443:1:Warning: Unused lexical variable ‘\.label’
flycheck.el:5443:1:Warning: Unused lexical variable ‘\.column_start’
flycheck.el:5443:1:Warning: Unused lexical variable ‘\.line_start’
flycheck.el:5443:1:Warning: Unused lexical variable ‘\.file_name’
flycheck.el:5443:1:Warning: Unused lexical variable ‘\.is_primary’
#+END_EXAMPLE

So just having warnings trigger a non-zero exit in Emacs 25?

As I suspected, the warnings are caused by nested ~let-alist~ calls.  With just
one ~let-alist~ the compiler does not complain, but when they are nested all the
~.name~ inside the nested calls are considered free variables.

Unnesting these calls make the warnings disappear.

But why are warnings appearing in the first place?  My understanding is that
~let-alist~ is a macro that adds syntactic sugar for looking up the alist.  This
is expanded at compile-time, and thus all ~.name~ should disappear.  But the
byte compiler still sees those that are in nested calls to ~let-alist~, so the
macro expansion is not recursively done?

#+BEGIN_SRC emacs-lisp
(cl-prettyexpand
 '(let-alist '((a . 1) (b . 2)) .a))

(let ((alist '((a . 1) (b . 2))))
  (let ((\.a (cdr (assq 'a alist))))
    \.a))
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC emacs-lisp
(cl-prettyexpand
 '(let-alist '((a . 1) (b . 2))
    (let-alist '((c . 3) (d . 4))
      .c)))

(let ((alist '((a . 1) (b . 2))))
  (let ((\.c (cdr (assq 'c alist))))
    (let ((alist '((c . 3) (d . 4))))
      (let ((\.c (cdr (assq 'c alist))))
        \.c))))
#+END_SRC


Ah!  The first ~let~ line triggers the warning.  This is because ~let-alist~
thinks every ~.name~ under it should apply to it, but this is false when nesting
calls.

If the expansion happened from the innermost ~let-alist~ first, I guess this
would work.  So it's a bug in ~let-alist~.

The docstring of ~let-alist~ acknowledges that you can nest it, with the
downside that you cannot access the variables of the outer ~let-alist~.  This is
obviously because the inner ones shadow the ~alist~ variable.  This is a hygiene
issue.

So, two bugs for nesting.  Thanks, ~let-alist~!

** Workarounds for let-alist                                       :flycheck:
The nesting bug has been bugging me.

Looking at the [[https://lists.gnu.org/archive/html/emacs-devel/2014-12/msg00231.html][original discussion]] for introducing ~let-alist~ to Emacs, there
a couple alternatives are mentioned.

Inline macro for reducing the ~cdr assq~ noise:

#+BEGIN_SRC emacs-lisp
(cl-macrolet ((a (field) `(cdr (assq ,field '((c . 1) (d . 2))))))
  (a 'c))
#+END_SRC

#+RESULTS:
: 1

And using ~pcase~:

#+BEGIN_SRC emacs-lisp
(pcase (alist-get-keys alist key1 key2 key3)
  (`(,val1 ,val2 ,val3) body))
#+END_SRC

but this one requires ~alist-get-keys~, which presumably is in Emacs 25.  But
Emacs 25 also includes ~alist-get~, which already reduces the noise a bit.

*** Fixing let-alist
Failed to mention last time that I spent hours trying to come up with a correct
macro to do what let-alist does.

One fix that worked was to prevent ~let-alist--deep-dot-search~ from expanding
dot symbols ('.a.b') inside another ~let-alist~.  Actually, I even made it to
stop searching when a supplied predicate function would return true on the
current node.

(Which could have been made more generally into a tree recursing function
operating on a predicate, like ~-tree-map-nodes~ from dash)

So the first ~let~ did not generate unused bindings.  But we could still not
access outer let-alist bindings, because if you look at this expansion:

#+BEGIN_SRC elisp
(cl-prettyexpand
 '(let-alist '((a . 1) (b . 2))
   (let-alist '((a . 2) (c . 3))
    .b)))

(let ((alist '((a . 1) (b . 2))))
  (let ((\.b (cdr (assq 'b alist))))
    (let ((alist '((a . 2) (c . 3))))
      (let ((\.b (cdr (assq 'b alist))))
        \.b))))
#+END_SRC

The second let will always bind all dotted symbols under it, shadowing the outer
bindings.  Even though 'b' is not a key in the inner alist, it still tries to
get that key.

Now, let-alist supports looking up deeply into nested alists:

#+BEGIN_SRC elisp
(let-alist '((a . 1) (b . ((a . 2) (b . 3))))
    .b.a)
#+END_SRC

#+RESULTS:
: 2

But in our case the JSON objects has arrays, so that's why we need a second
let-alist call.

I tried to define a macro, ~alist-let~ that would have worked like so:

#+BEGIN_SRC elisp
(alist-let (a. '((a . 1) (b . 2)))
   (a. 'a))
;; => 1
#+END_SRC

The plan was for that to expand to:

#+BEGIN_SRC elisp
(let ((alist-a '((a . 1) (b . 2))))
  (cl-macrolet  ((a. (field) `(cdr (assq ,field alist-a))))
    (a. 'a)))
#+END_SRC

which in turn would expand to:

#+BEGIN_SRC elisp
(let ((alist-a '((a . 1) (b . 2))))
   (cdr (assq 'a alist-a)))
#+END_SRC

But since ~alist-let~ was a macro that invoked ~cl-macrolet~, I never got it to
work correctly.  The tricky part was to pass ~alist-a~ to ~cl-macrolet~ even
though the binding inside ~cl-macrolet~ is inside a backquote.

Maybe I should have used two macros?

Also, it's not zero-cost still, since all calls to ~a.~ would expand to ~cdr
assq~.  With ~let-alist~, the looking up is done once in a surround ~let~.

So the expansion of ~alist-let~ that you want is:

#+BEGIN_SRC elisp
(let* ((alist-a '((a . 1) (b . 2)))
       (alist-a-0 (cdr (assq 'a alist-a))))
   alist-a-0)
#+END_SRC

*** Gensym trouble
Version 1 of my ~alist-let~ macro:

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  `(let ((alist-a ,alist))
     (cl-macrolet ((,getter (field) `(cdr (assq ,field alist-a))))
       ,@body)))

(cl-prettyexpand
 '(alist-let a. '((a . 1) (b . 2))
    (a. 'a)))

(let ((alist-a '((a . 1) (b . 2))))
  (progn
    (cdr (assq 'a alist-a))))
#+END_SRC

Works, but ~alist-a~ is not hygienic:

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  `(let ((alist-a ,alist))
     (cl-macrolet ((,getter (field) `(cdr (assq ,field alist-a))))
       ,@body)))

(alist-let a. '((a . 1) (b . 2))
  alist-a)
#+END_SRC

#+RESULTS:
: ((a . 1) (b . 2))

So you want to generate a symbol to use instead of ~alist-a~:

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let ((alist-a (gensym)))
    `(let ((,alist-a ,alist))
       (cl-macrolet ((,getter (field) `(cdr (assq ,field ,alist-a))))
         ,@body))))
#+END_SRC

Now, as I understand it, ~alist-a~ is a symbol that's generated at expansion
time by ~gensym~.  The macro expands to the same let as before, except now the
binding ~alist-a~ is variable, that's why there is a comma in front.  Inside
~cl-macrolet~, ~alist-a~ must also refer to the generated symbol, hence the
comma.

The problem is that the expansion of ~cl-macrolet~ fails to find ~alist-a~.

We can check that binding the gensym at expansion works:

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let ((alist-a (gensym)))
    `(let ((,alist-a ,alist))
         ,@body)))

(cl-prettyexpand
 '(alist-let a. '((a . 1) (b . 2))
    (a. 'a)))

(let ((G23147 '((a . 1) (b . 2))))
  (a\. 'a))
#+END_SRC

Using ~pp-macroexpand~, we can see that indeed after expanding ~alist-let~, but
not ~cl-macrolet~, we get:

#+BEGIN_SRC elisp
(pp-macroexpand-expression
 '(alist-let a. '((a . 1) (b . 2))
    (a. 'a)))

(let ((G23158 '((a . 1) (b . 2))))
  (cl-macrolet
      ((a\. (field) `(cdr (assq ,field ,alist-a))))
    (a\. 'a)))
#+END_SRC

~alist-a~ is not expanded, and the binding is lost.  So that's why it fails.

Is it because of the second backquote?

#+BEGIN_SRC elisp
(defmacro test ()
  (let ((var "somethin"))
    `(,var `(,var))))

(cl-prettyexpand
 '(test))

("somethin" (list var))
#+END_SRC

#+BEGIN_SRC elisp
(defmacro test ()
  (let ((var "somethin"))
    `(,var (,var))))

(cl-prettyexpand
 '(test))
("somethin" ("somethin"))
#+END_SRC

Ah, indeed.

Another way to see why it's wrong is to look at the line of the macrolet:

: (cl-macrolet ((,getter (field) `(cdr (assq ,field ,alist-a))))

See, both ~field~ and ~alist-a~ have a comma in front.  But clearly, we want
~alist-a~ to be expanded when ~alist-let~ expands, and ~field~ to be expanded
only when the macrolet ~getter~ expands.

So what if we build the binding form of ~cl-macrolet~ beforehand?

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let* ((alist-a (gensym))
         (str (read (format "`(cdr (assq ,field %s))" alist-a))))
    `(let ((,alist-a ,alist))
       (cl-macrolet ((,getter (field) ,str))
         ,@body))))

(cl-prettyexpand
 '(alist-let a. '((a . 1) (b . 2))
    (a. 'a)))

(let ((G23159 '((a . 1) (b . 2))))
  (progn
    (cdr (assq 'a G23159))))
#+END_SRC

Ah!  It works.  Gosh.  I spent hours trying to workaround that, and even tried
the string route with ~eval~.  I was so tired that I did not bother taking notes
as I went along, but taking notes would have forced me to work out what was
wrong in the approach.

Anyway, there is still the downside of not saving all these lookups into a let.

But elisp has one last surprise in store for me!  When I try to nest ~alist-let~
calls:

#+BEGIN_SRC elisp
(alist-let a. '((a . 1) (b . 2))
  (alist-let b. '((c . 3) (d . 4))
    (b. 'c)))
;; => Symbol's value as a variable is void: G23170
#+END_SRC

Damned!  How does the expansion looks like?

#+BEGIN_SRC elisp
(cl-prettyexpand
'(alist-let a. '((a . 1) (b . 2))
  (alist-let b. '((c . 3) (d . 4))
   (b. 'c))))

(let ((G23198 '((a . 1) (b . 2))))
  (progn
    (let ((G23199 '((c . 3) (d . 4))))
      (progn
        (cdr (assq 'c G23199))))))
#+END_SRC

#+RESULTS:
: 3

Wait, it works?  What the hell?  Expansion works, but not evaluation?

Actually, it also fails without nesting:

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let* ((alist-a (gensym))
         (str (read (format "`(cdr (assq ,field %s))" alist-a))))
    `(let ((,alist-a ,alist))
       (cl-macrolet ((,getter (field) ,str))
         ,@body))))

(alist-let a. '((a . 1) (b . 2))
  (a. 'b))
;; => Symbol's value as a variable is void: G23199
#+END_SRC

Now, a clue might be that even a simple ~macroexpand~ also fails:

#+BEGIN_SRC elisp
(macroexpand
 (alist-let a. '((a . 1) (b . 2))
     (a. 'b)))
;; => Symbol's value as a variable is void: G23200
#+END_SRC

Whereas ~cl-prettyexpand~ does not.  I've read somewhere that CommonLisp has
different macro expansion semantics than Elisp.  The ~cl-~ prefix stands for
CommonLisp.  Coincidence?

Well, macrostep-mode seems to agree with me:

#+BEGIN_SRC elisp
(let
    ((G24180 '((a . 1) (b . 2))))
  (cl-macrolet
      ((a\. (field) `(cdr (assq ,field G24180))))
    (a\. 'b)))
#+END_SRC

then:

#+BEGIN_SRC lisp
(let
    ((G24180 '((a . 1) (b . 2))))
  (progn
    (cdr (assq 'b G24180))))
#+END_SRC

So if the expansion under CommonLisp rules is not the same as under the Elisp
rules, I get a working expression but evaluating the expression without
expanding it first fails.  Still, it's weird that macrostep concurs with
~cl-prettyexpand~ then.

But the debugger reveals that is not the correct explanation.  If I 'C-x C-e'
the expression:

#+BEGIN_SRC elisp
(alist-let a. '((a . 1) (b . 2))
  (a. 'b))
#+END_SRC

Here is what the debugger says:

#+BEGIN_SRC elisp
Debugger entered--Lisp error: (void-variable G56132)
  (assq (quote b) G56132)
  (cdr (assq (quote b) G56132))
  (progn (cdr (assq (quote b) G56132)))
  (let ((G56132 (quote ((a . 1) (b . 2))))) (progn (cdr (assq (quote b) G56132))))
  eval((let ((G56132 (quote ((a . 1) (b . 2))))) (progn (cdr (assq (quote b) G56132)))) nil)
#+END_SRC

So actually, the debugger sees exactly what ~cl-prettyexpand~ gives me.  But for
some reason, it claims to fail evaluating that?

If I execute myself:

#+BEGIN_SRC elisp
(let ((G56132 (quote ((a . 1) (b . 2))))) (progn (cdr (assq (quote b) G56132))))
#+END_SRC

#+RESULTS:
: 2

It works.  Grumble.

I think I need to consult an expert.

Trying one more thing.  I read on the emacs-devel thread announcing ~let-alist~
that ~make-symbol~ is to be preferred to ~gensym~.  Don't know why.  Does it
make a difference here?

#+BEGIN_SRC elisp
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let* ((alist-a (make-symbol "alist"))
         (str (read (format "`(cdr (assq ,field %s))" alist-a))))
    `(let ((,alist-a ,alist))
       (cl-macrolet ((,getter (field) ,str))
         ,@body))))

(cl-prettyexpand
 '(alist-let a. '((a . 1) (b . 2))
   (a. 'b)))

(let ((alist '((a . 1) (b . 2))))
  (progn
    (cdr (assq 'b alist))))


(alist-let a. '((a . 1) (b . 2))
           (a. 'b))
;; => Error
#+END_SRC

Nope.

I want to get to the bottom of this.  Let's make a minimal test case.

This still fails, but executing the expansion does not:

#+BEGIN_SRC elisp
(defmacro test-gensym ()
  (let* ((sym (gensym))
         (sexp (read (format "%s" sym))))
    `(let ((,sym 12))
       ,sexp)))

(cl-prettyexpand
 '(test-gensym))

(let ((G57457 12))
  G57457) ; => 12

(test-gensym) ; => Error
#+END_SRC

While the very similar:

#+BEGIN_SRC elisp
(defmacro test-gensym ()
  (let* ((sym (gensym))
         (sexp `,sym))
    `(let ((,sym 12))
       ,sexp)))
#+END_SRC

works.

So I'm assuming that reading a symbol makes it different somehow?

#+BEGIN_SRC elisp
(let (sym (gensym))
  (eq sym `,sym)) ; => t

(let (sym (gensym))
  (eq sym (read (format "%s" sym)))) ; => t
#+END_SRC

Nope.  Weird.

Still:

#+BEGIN_SRC elisp
(defmacro test-gensym ()
  (let* ((sym (gensym))
         (read-sym (read (format "%s" sym))))
    `(let ((,sym 42))
       ,sym)))

(cl-prettyexpand
 '(test-gensym))

(let ((G57812 42))
  G57812) ; => 42

(test-gensym) ; => 42
#+END_SRC

Reading about gensym in the manual, I find a related gentemp that creates an
interned symbol.  With gentemp, it works:

#+BEGIN_SRC elisp
(defmacro test-gensym ()
  (let* ((sym (gentemp))
         (read-sym (read (format "%s" sym))))
    `(let ((,sym 42))
       ,read-sym)))

(test-gensym) ; => 42
#+END_SRC

Does interning means we can still have name clashes?  If I know G57833 to be the
next generated symbol?

#+BEGIN_SRC elisp
(defmacro test-gensym (&rest body)
  (let* ((sym (gentemp)))
    `(let ((,sym 42))
       ,@body)))

(test-gensym G57833) ; => error G57833 not found
#+END_SRC

Hmm.  Actually, gentemp keeps increasing when the symbol exists.  So it's
guaranteed to be fresh.

Does this mean...?

#+BEGIN_SRC elisp :results verbatim
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let* ((alist-name (gentemp))
         (str (read (format "`(cdr (assq ,field %s))" alist-name))))
    `(let ((,alist-name ,alist))
       (cl-macrolet ((,getter (field) ,str))
         ,@body))))

(alist-let a. '((a . 1) (b . 2))
  (alist-let b. '((c . 3) (d . 4))
    (list (a. 'a) (b. 'c))))
#+END_SRC

#+RESULTS:
: (1 3)

Yes!  YES!

So it:
- provides a shortcut for getting values out of alists
- can be nested
- is hygienic

The only downside is that each call to ~(a. 'a)~ expands to ~(cdr (assq~, which
maybe you want to avoid.  But, the good news is, if you want to save the result,
you can do it YOURSELF:

#+BEGIN_SRC elisp :results verbatim
(defmacro alist-let (getter alist &rest body)
  (declare (indent 2))
  (let* ((alist-name (gentemp))
         (str (read (format "`(cdr (assq ,field %s))" alist-name))))
    `(let ((,alist-name ,alist))
       (cl-macrolet ((,getter (field) ,str))
         ,@body))))

(cl-prettyexpand
'(alist-let a. '((a . 1) (b . 2))
  (alist-let b. '((c . 3) (d . 4))
    (let ((val (a. 'a)))
     (list val val (b. 'c))))))

(let ((G57854 '((a . 1) (b . 2))))
  (progn
    (let ((G57855 '((c . 3) (d . 4))))
      (progn
        (let ((val (cdr (assq 'a G57854))))
          (list val val (cdr (assq 'c G57855))))))))
#+END_SRC

#+RESULTS:
(1 1 3)

Considering that to have results auto-memoize you would need to do a tree
recursion when macro expanding... which led to one of the (fixable) issue with
~let-alist~... I'd say it's not worth it.  I prefer to be explicit anyway.

*** Destructuring using dash
Ronan also found that there is alist destructuring in the latest dash (2.13).

#+BEGIN_SRC elisp
(-let [(&alist 'a a) '((a . 1) (b . 2))]
  a)
#+END_SRC

#+RESULTS:
: 1

And to get values from nested alists:

#+BEGIN_SRC elisp
(-let [(&alist
        'a a
        'c (&alist 'ca ca))
       '((a . 1) (b . 2) (c . ((ca . 3))))]
  ca)
#+END_SRC

#+RESULTS:
: 3

So this would definitely work.  You just have to destructure in advance.

